In [1]:
#question 1

import pandas as pd

df = pd.Series([4,8,15,16,23,42])

df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
#question 2 
l = [1,2,3,4,5,6,7,8,9,10]

df = pd.Series(l)

df
type(df)

pandas.core.series.Series

In [12]:
#question 3 

df = pd.DataFrame({'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
#question 4 

"DataFrame is a two-dimensional, size-mutable, and heterogeneous tabular data structure with labeled axes (rows and columns). It is one of the core data structures provided by the pandas library for data manipulation and analysis in Python."

"a Series is a one-dimensional labeled array, which can be seen as a single column of data in a DataFrame. It has an index that can be used to label the data points, and it can hold data of any data type."

In [13]:
#question 5 

df = pd.DataFrame({'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']})

df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
df.iloc[0:1]

    Name  Age  Gender
0  Alice   25  Female

In [15]:
df.loc[0:1]

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [17]:
df.sort_values('Age')

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

In [ ]:
#question 6

"A series and a dataframes both are mutable in nature"

In [18]:
#question 7 

df = pd.Series([4,8,15,16,23,42])
df2 = pd.Series([1,2,3,4,5,6])

AttributeError: 'DataFrame' object has no attribute 'concat'